{
  "version": "1.0",
  "description": "TOPIK II 54번 채점을 위한 Few-shot 예시 데이터",
  "examples": [
    {
      "id": "high-1",
      "level": "고득점",
      "topic": "현대 사회에서 환경 보호가 중요한 이유와 실천 방안에 대해 자신의 의견을 쓰시오.",
      "content": "현대 사회에서 환경 보호는 인류의 지속 가능한 발전을 위해 반드시 필요한 과제이다. 산업화와 도시화가 급속히 진행되면서 지구 환경은 심각한 위기에 직면해 있기 때문이다.\n\n첫째, 환경 오염은 인간의 건강에 직접적인 영향을 미친다. 대기 오염으로 인한 호흡기 질환이 증가하고 있으며, 수질 오염은 각종 질병의 원인이 되고 있다. 실제로 세계보건기구에 따르면, 매년 수백만 명이 환경 오염으로 인한 질병으로 사망하고 있다. 이러한 점에서 환경 보호는 곧 인간의 생존과 직결된 문제라고 할 수 있다.\n\n둘째, 기후 변화는 전 지구적인 재앙을 초래할 수 있다. 온실가스 배출로 인한 지구 온난화는 해수면 상승, 이상 기후 등 다양한 문제를 야기하고 있다. 이미 많은 국가에서 홍수, 가뭄, 폭염 등의 피해가 증가하고 있으며, 이는 앞으로 더욱 심화될 것으로 예측된다.\n\n환경 보호를 실천하기 위해서는 개인과 사회 모두의 노력이 필요하다. 개인적 차원에서는 일회용품 사용을 줄이고, 대중교통을 이용하며, 에너지를 절약하는 등의 작은 실천이 중요하다. 사회적 차원에서는 정부가 환경 규제를 강화하고, 친환경 산업을 육성해야 할 것이다.\n\n결론적으로, 환경 보호는 선택이 아닌 필수적인 과제이다. 우리 모두가 환경의 소중함을 인식하고 적극적으로 실천한다면, 더 나은 미래를 후손에게 물려줄 수 있을 것이다.",
      "scores": {
        "content": 18,
        "structure": 14,
        "language": 13,
        "total": 45
      },
      "feedback": {
        "content": "주제를 정확히 파악하고 환경 보호의 중요성과 실천 방안을 균형 있게 다루었습니다. WHO 통계를 예로 들어 설득력을 높였습니다.",
        "structure": "서론-본론-결론 구조가 명확하고, '첫째', '둘째', '결론적으로' 등의 담화 표지를 효과적으로 사용하여 논리적 흐름이 자연스럽습니다.",
        "language": "'-ㄴ다고 할 수 있다', '-ㄹ 것으로 예측된다' 등 격식체 문어 표현을 적절히 사용했습니다. 어휘가 다양하고 문법적 오류가 거의 없습니다.",
        "overall": "전반적으로 TOPIK 6급 수준의 우수한 답안입니다. 조금 더 구체적인 사례를 추가하면 만점에 가까운 답안이 될 것입니다."
      },
      "estimated_level": "6급",
      "strengths": ["명확한 구조", "적절한 근거 제시", "고급 표현 사용"],
      "improvements": ["더 구체적인 사례 추가 가능"]
    },
    {
      "id": "mid-1",
      "level": "중간",
      "topic": "현대 사회에서 스마트폰이 우리 생활에 미치는 영향에 대해 쓰시오.",
      "content": "스마트폰은 현대 사회에서 없어서는 안 되는 필수품이 되었다. 스마트폰이 우리 생활에 미치는 영향은 긍정적인 면과 부정적인 면이 있다.\n\n먼저 긍정적인 영향을 보면, 스마트폰으로 언제 어디서나 정보를 얻을 수 있다. 인터넷 검색이나 뉴스를 볼 수 있고, 외국어 공부도 할 수 있다. 그리고 가족이나 친구와 쉽게 연락할 수 있어서 편리하다. 또한 은행 업무나 쇼핑도 스마트폰으로 할 수 있다.\n\n하지만 부정적인 영향도 있다. 스마트폰을 너무 많이 사용하면 건강에 좋지 않다. 눈이 나빠지고 목이나 손목이 아플 수 있다. 또한 스마트폰에 중독되어서 공부나 일에 집중하기 어려워질 수 있다. 특히 청소년들은 게임이나 SNS에 빠져서 학업에 문제가 생기기도 한다.\n\n그러므로 스마트폰을 사용할 때는 적당히 사용하는 것이 중요하다. 스마트폰의 장점을 잘 활용하면서 단점을 줄이도록 노력해야 한다.",
      "scores": {
        "content": 14,
        "structure": 10,
        "language": 10,
        "total": 34
      },
      "feedback": {
        "content": "긍정적, 부정적 영향을 모두 다루었으나, 각 측면의 근거가 나열식으로 제시되어 깊이가 부족합니다. 구체적인 통계나 사례가 있으면 더 설득력 있을 것입니다.",
        "structure": "'먼저', '하지만', '그러므로' 등 기본적인 연결어를 사용했으나, 문단 내 논리 전개가 다소 단순합니다. 결론이 짧고 내용이 빈약합니다.",
        "language": "중급 수준의 어휘와 문법을 사용했습니다. '좋지 않다', '어려워질 수 있다' 등 표현이 단조롭습니다. 고급 연결어미나 문어체 표현이 부족합니다.",
        "overall": "TOPIK 4급 수준의 답안입니다. 더 다양한 어휘와 고급 표현을 사용하고, 각 주장에 대한 구체적인 근거를 보강하면 좋겠습니다."
      },
      "estimated_level": "4급",
      "strengths": ["기본 구조 갖춤", "긍정/부정 균형"],
      "improvements": ["결론 보강 필요", "구체적 사례 추가", "고급 표현 사용"]
    },
    {
      "id": "mid-2",
      "level": "중간",
      "topic": "여행이 우리에게 주는 이점에 대해 자신의 의견을 쓰시오.",
      "content": "나는 여행이 우리에게 많은 이점을 준다고 생각한다. 여행을 하면 좋은 점이 많이 있다.\n\n첫 번째로 여행은 스트레스를 해소하는 데 도움이 된다. 일상생활에서 벗어나서 새로운 곳에 가면 기분이 좋아진다. 아름다운 경치를 보거나 맛있는 음식을 먹으면 스트레스가 풀린다. 나도 지난 여름에 제주도에 여행을 가서 많이 힐링이 됐다.\n\n두 번째로 여행을 하면 새로운 경험을 할 수 있다. 다른 나라에 가면 그 나라의 문화를 경험할 수 있다. 예를 들어 일본에 가면 일본 음식을 먹고 일본어를 들을 수 있다. 이런 경험은 책에서 배우는 것보다 훨씬 좋다.\n\n세 번째로 여행은 가족이나 친구와 좋은 추억을 만들 수 있다. 같이 여행을 가면 더 친해지고 재미있는 추억이 생긴다.\n\n그래서 나는 사람들이 여행을 많이 하면 좋겠다. 여행은 우리 삶을 더 풍요롭게 해 준다.",
      "scores": {
        "content": 12,
        "structure": 9,
        "language": 9,
        "total": 30
      },
      "feedback": {
        "content": "여행의 장점을 세 가지로 제시했으나, 개인적 경험 위주로 서술하여 객관성이 부족합니다. '이런 경험은 책에서 배우는 것보다 훨씬 좋다'와 같은 표현은 근거가 부족합니다.",
        "structure": "'첫 번째로', '두 번째로', '세 번째로'로 구조화했으나, 세 번째 항목이 너무 짧습니다. 서론과 결론이 빈약합니다.",
        "language": "'많이 있다', '기분이 좋아진다' 등 기본적인 표현 위주입니다. '힐링이 됐다'는 구어체 표현입니다. 문어체 표현 사용이 필요합니다.",
        "overall": "TOPIK 3-4급 수준입니다. 개인적 경험보다는 일반적인 관점에서 서술하고, 구어체 표현을 피하며, 각 항목의 분량을 균형 있게 작성하면 좋겠습니다."
      },
      "estimated_level": "3급",
      "strengths": ["번호를 사용한 구조화 시도"],
      "improvements": ["구어체 표현 수정", "객관적 근거 추가", "분량 균형 필요", "서론/결론 보강"]
    },
    {
      "id": "low-1",
      "level": "저득점",
      "topic": "독서의 중요성에 대해 자신의 의견을 쓰시오.",
      "content": "독서는 중요합니다. 책을 읽으면 좋습니다.\n\n책을 많이 읽으면 지식이 많아집니다. 그리고 어휘도 많이 알게 됩니다. 책을 읽으면 상상력도 좋아집니다. 저는 책 읽는 것을 좋아합니다. 재미있는 책이 많습니다.\n\n요즘 사람들은 책을 안 읽습니다. 스마트폰만 봅니다. 이것은 문제입니다. 책을 읽어야 합니다.\n\n그래서 독서는 중요합니다. 모두 책을 많이 읽으면 좋겠습니다.",
      "scores": {
        "content": 8,
        "structure": 5,
        "language": 6,
        "total": 19
      },
      "feedback": {
        "content": "독서의 중요성에 대한 주장은 있으나, 구체적인 근거나 예시가 거의 없습니다. '지식이 많아집니다', '상상력도 좋아집니다'라는 주장에 대한 설명이 필요합니다.",
        "structure": "문단 구분이 있으나 각 문단이 너무 짧고, 내용 전개가 단편적입니다. 서론-본론-결론의 구분이 불명확하며, 연결어 사용이 부족합니다.",
        "language": "문장이 매우 짧고 단순합니다. '~습니다' 종결어미가 반복되어 단조롭습니다. '안 읽습니다'는 '읽지 않습니다'로 수정하는 것이 좋습니다. 분량도 부족합니다(400자 미만).",
        "overall": "TOPIK 2급 수준입니다. 분량을 600자 이상으로 늘리고, 각 주장에 대한 구체적인 설명과 예시를 추가해야 합니다. 다양한 문장 구조와 연결어를 사용해 보세요."
      },
      "estimated_level": "2급",
      "strengths": ["기본적인 주장 제시"],
      "improvements": ["분량 부족", "구체적 근거 필요", "연결어 사용", "문장 다양화", "구어체 수정"]
    },
    {
      "id": "low-2",
      "level": "저득점",
      "topic": "건강을 유지하기 위한 방법에 대해 쓰시오.",
      "content": "건강은 정말 중요해요. 건강하면 행복하니까요.\n\n건강을 유지하려면 운동을 해야 돼요. 저도 매일 운동해요. 운동하면 기분이 좋아요. 그리고 잘 먹어야 해요. 야채도 먹고 과일도 먹어야 해요. 패스트푸드는 안 좋아요.\n\n또 잠을 잘 자야 해요. 잠을 못 자면 피곤해요. 스트레스도 안 받으면 좋아요. 스트레스 받으면 건강이 안 좋아져요.\n\n그래서 건강을 위해서 노력해야 해요. 건강이 제일이에요.",
      "scores": {
        "content": 7,
        "structure": 4,
        "language": 4,
        "total": 15
      },
      "feedback": {
        "content": "건강 유지 방법으로 운동, 식사, 수면, 스트레스 관리를 언급했으나, 모두 피상적인 수준에 그쳤습니다. 왜 이것들이 중요한지, 어떻게 실천할 수 있는지에 대한 설명이 없습니다.",
        "structure": "문단 구분이 있으나 논리적 연결이 부족합니다. 각 항목이 나열되기만 하고 유기적으로 연결되지 않았습니다. 서론과 결론이 너무 짧습니다.",
        "language": "전체적으로 구어체('-요' 종결)를 사용했습니다. TOPIK 쓰기에서는 '-습니다/-ㅂ니다' 또는 '-다' 종결의 문어체를 사용해야 합니다. '안 좋아요'보다 '좋지 않습니다'가 적절합니다.",
        "overall": "TOPIK 2급 이하 수준입니다. 가장 시급한 문제는 구어체 사용입니다. 반드시 문어체로 수정하고, 분량을 늘리며, 각 방법에 대한 구체적인 설명을 추가해야 합니다."
      },
      "estimated_level": "1급",
      "strengths": ["주제와 관련된 내용 포함"],
      "improvements": ["구어체 → 문어체 필수", "분량 부족 (600자 이상 필요)", "구체적 설명 추가", "연결어 사용"]
    }
  ]
}
